domainStr=top,xyz,xin,vip,win,red,net,org,wang,gov,edu,mil,biz,name,info,mobi,pro,\
            travel,club,museum,int,aero,post,rec,asia
telFirst=134,135,136,137,138,139,150,151,152,157,158,159,130,131,132,155,156,133,153
road=\u91CD\u5E86\u5927\u53A6,\u9ED1\u9F99\u6C5F\u8DEF,\u5341\u6885\u5EB5\u8857,\u9075\u4E49\u8DEF,\u6E58\u6F6D\u8857,\u745E\u91D1\u5E7F\u573A,\u4ED9\u5C71\u8857,\u4ED9\u5C71\u4E1C\u8DEF,\u4ED9\u5C71\u897F\u5927\u53A6,\u767D\u6C99\u6CB3\u8DEF,\u8D75\u7EA2\u5E7F\u573A,\u673A\u573A\u8DEF,\
      \u6C11\u822A\u8857,\u957F\u57CE\u5357\u8DEF,\u6D41\u4EAD\u7ACB\u4EA4\u6865,\u8679\u6865\u5E7F\u573A,\u957F\u57CE\u5927\u53A6,\u793C\u9633\u8DEF,\u98CE\u5C97\u8857,\u4E2D\u5DDD\u8DEF,\u767D\u5854\u5E7F\u573A,\u5174\u9633\u8DEF,\u6587\u9633\u8857,\u7EE3\u57CE\u8DEF,\u6CB3\u57CE\u5927\u53A6,\
      \u9526\u57CE\u5E7F\u573A,\u5D07\u9633\u8857,\u534E\u57CE\u8DEF,\u5EB7\u57CE\u8857,\u6B63\u9633\u8DEF,\u548C\u9633\u5E7F\u573A,\u4E2D\u57CE\u8DEF,\u6C5F\u57CE\u5927\u53A6,\u987A\u57CE\u8DEF,\u5B89\u57CE\u8857,\u5C71\u57CE\u5E7F\u573A,\u6625\u57CE\u8857,\u56FD\u57CE\u8DEF,\u6CF0\u57CE\u8857,\
      \u5FB7\u9633\u8DEF,\u660E\u9633\u5927\u53A6,\u6625\u9633\u8DEF,\u8273\u9633\u8857,\u79CB\u9633\u8DEF,\u7855\u9633\u8857,\u9752\u5A01\u9AD8\u901F,\u745E\u9633\u8857,\u4E30\u6D77\u8DEF,\u53CC\u5143\u5927\u53A6,\u60DC\u798F\u9547\u8857\u9053,\u590F\u5E84\u8857\u9053,\u53E4\u5E99\u5DE5\u4E1A\u56ED,\
      \u4E2D\u5C71\u8857,\u592A\u5E73\u8DEF,\u5E7F\u897F\u8857,\u6F4D\u53BF\u5E7F\u573A,\u535A\u5C71\u5927\u53A6,\u6E56\u5357\u8DEF,\u6D4E\u5B81\u8857,\u829D\u7F58\u8DEF,\u6613\u5DDE\u5E7F\u573A,\u8377\u6CFD\u56DB\u8DEF,\u8377\u6CFD\u4E8C\u8857,\u8377\u6CFD\u4E00\u8DEF,\u8377\u6CFD\u4E09\u5927\u53A6,\
      \u89C2\u6D77\u4E8C\u5E7F\u573A,\u5E7F\u897F\u652F\u8857,\u89C2\u6D77\u4E00\u8DEF,\u6D4E\u5B81\u652F\u8857,\u8392\u53BF\u8DEF,\u5E73\u5EA6\u5E7F\u573A,\u660E\u6C34\u8DEF,\u8499\u9634\u5927\u53A6,\u9752\u5C9B\u8DEF,\u6E56\u5317\u8857,\u6C5F\u5B81\u5E7F\u573A,\u90EF\u57CE\u8857,\u5929\u6D25\u8DEF,\
      \u4FDD\u5B9A\u8857,\u5B89\u5FBD\u8DEF,\u6CB3\u5317\u5927\u53A6,\u9EC4\u5C9B\u8DEF,\u5317\u4EAC\u8857,\u8398\u53BF\u8DEF,\u6D4E\u5357\u8857,\u5B81\u9633\u5E7F\u573A,\u65E5\u7167\u8857,\u5FB7\u53BF\u8DEF,\u65B0\u6CF0\u5927\u53A6,\u8377\u6CFD\u8DEF,\u5C71\u897F\u5E7F\u573A,\u6C82\u6C34\u8DEF,\
      \u80A5\u57CE\u8857,\u5170\u5C71\u8DEF,\u56DB\u65B9\u8857,\u5E73\u539F\u5E7F\u573A,\u6CD7\u6C34\u5927\u53A6,\u6D59\u6C5F\u8DEF,\u66F2\u961C\u8857,\u5BFF\u5EB7\u8DEF,\u6CB3\u5357\u5E7F\u573A,\u6CF0\u5B89\u8DEF,\u5927\u6CBD\u8857,\u7EA2\u5C71\u5CE1\u652F\u8DEF,\u897F\u9675\u5CE1\u4E00\u5927\u53A6,\
      \u53F0\u897F\u7EAC\u4E00\u5E7F\u573A,\u53F0\u897F\u7EAC\u56DB\u8857,\u53F0\u897F\u7EAC\u4E8C\u8DEF,\u897F\u9675\u5CE1\u4E8C\u8857,\u897F\u9675\u5CE1\u4E09\u8DEF,\u53F0\u897F\u7EAC\u4E09\u5E7F\u573A,\u53F0\u897F\u7EAC\u4E94\u8DEF,\u660E\u6708\u5CE1\u5927\u53A6,\u9752\u94DC\u5CE1\u8DEF,\u53F0\u897F\u4E8C\u8857,\
      \u89C2\u97F3\u5CE1\u5E7F\u573A,\u77BF\u5858\u5CE1\u8857,\u56E2\u5C9B\u4E8C\u8DEF,\u56E2\u5C9B\u4E00\u8857,\u53F0\u897F\u4E09\u8DEF,\u53F0\u897F\u4E00\u5927\u53A6,\u90D3\u57CE\u5357\u8DEF,\u56E2\u5C9B\u4E09\u8857,\u5218\u5BB6\u5CE1\u8DEF,\u897F\u85CF\u4E8C\u8857,\u897F\u85CF\u4E00\u5E7F\u573A,\
      \u53F0\u897F\u56DB\u8857,\u4E09\u95E8\u5CE1\u8DEF,\u57CE\u6B66\u652F\u5927\u53A6,\u7EA2\u5C71\u5CE1\u8DEF,\u90D3\u57CE\u5317\u5E7F\u573A,\u9F99\u7F8A\u5CE1\u8DEF,\u897F\u9675\u5CE1\u8857,\u53F0\u897F\u4E94\u8DEF,\u56E2\u5C9B\u56DB\u8857,\u77F3\u6751\u5E7F\u573A,\u5DEB\u5CE1\u5927\u53A6,\u56DB\u5DDD\u8DEF,\
      \u5BFF\u5F20\u8857,\u5609\u7965\u8DEF,\u5357\u6751\u5E7F\u573A,\u8303\u53BF\u8DEF,\u897F\u5EB7\u8857,\u4E91\u5357\u8DEF,\u5DE8\u91CE\u5927\u53A6,\u897F\u6C5F\u5E7F\u573A,\u9C7C\u53F0\u8857,\u5355\u53BF\u8DEF,\u5B9A\u9676\u8857,\u6ED5\u53BF\u8DEF,\u949C\u91CE\u5E7F\u573A,\u89C2\u57CE\u8DEF,\
      \u6C76\u4E0A\u5927\u53A6,\u671D\u57CE\u8DEF,\u6ECB\u9633\u8857,\u90B9\u53BF\u5E7F\u573A,\u6FEE\u53BF\u8857,\u78C1\u5C71\u8DEF,\u6C76\u6C34\u8857,\u897F\u85CF\u8DEF,\u57CE\u6B66\u5927\u53A6,\u56E2\u5C9B\u8DEF,\u5357\u9633\u8857,\u5E7F\u5DDE\u8DEF,\u4E1C\u5E73\u8857,\u67A3\u5E84\u5E7F\u573A,\
      \u8D35\u5DDE\u8857,\u8D39\u53BF\u8DEF,\u5357\u6D77\u5927\u53A6,\u767B\u5DDE\u8DEF,\u6587\u767B\u5E7F\u573A,\u4FE1\u53F7\u5C71\u652F\u8DEF,\u5EF6\u5B89\u4E00\u8857,\u4FE1\u53F7\u5C71\u8DEF,\u5174\u5B89\u652F\u8857,\u798F\u5C71\u652F\u5E7F\u573A,\u7EA2\u5C9B\u652F\u5927\u53A6,\u83B1\u829C\u4E8C\u8DEF
email_suffix=@gmail.com,@yahoo.com,@msn.com,@hotmail.com,@aol.com,@ask.com,@live.com,\
      @qq.com,@0355.net,@163.com,@163.net,@263.net,@3721.net,@yeah.net,@googlemail.com,\
      @126.com,@sina.com,@sohu.com,@yahoo.com.cn
province=\u5317\u4EAC\u5E02,\u5929\u6D25\u5E02,\u4E0A\u6D77\u5E02,\u91CD\u5E86\u5E02,\u6CB3\u5317\u7701,\u5C71\u897F\u7701,\u8FBD\u5B81\u7701,\u5409\u6797\u7701,\u9ED1\u9F99\u6C5F\u7701,\u6C5F\u82CF\u7701,\u6D59\u6C5F\u7701,\u5B89\u5FBD\u7701,\u798F\u5EFA\u7701,\u6C5F\u897F\u7701,\
      \u5C71\u4E1C\u7701,\u6CB3\u5357\u7701,\u6E56\u5317\u7701,\u6E56\u5357\u7701,\u5E7F\u4E1C\u7701,\u6D77\u5357\u7701,\u56DB\u5DDD\u7701,\u8D35\u5DDE\u7701,\u4E91\u5357\u7701,\u9655\u897F\u7701,\u7518\u8083\u7701,\u9752\u6D77\u7701,\u53F0\u6E7E\u7701,\u5185\u8499\u53E4\u81EA\u6CBB\u533A,\
      \u5E7F\u897F\u58EE\u65CF\u81EA\u6CBB\u533A,\u897F\u85CF\u81EA\u6CBB\u533A,\u5B81\u590F\u56DE\u65CF\u81EA\u6CBB\u533A,\u65B0\u7586\u7EF4\u543E\u5C14\u81EA\u6CBB\u533A,\u9999\u6E2F\u7279\u522B\u884C\u653F\u533A,\u6FB3\u95E8\u7279\u522B\u884C\u653F\u533A
city=\u5317\u4EAC,\u4E0A\u6D77,\u5E7F\u5DDE,\u6DF1\u5733,\u6210\u90FD,\u676D\u5DDE,\u91CD\u5E86,\u6B66\u6C49,\u897F\u5B89,\u82CF\u5DDE,\u5929\u6D25,\u5357\u4EAC,\u957F\u6C99,\u90D1\u5DDE,\u4E1C\u839E,\u9752\u5C9B,\u6C88\u9633,\u5B81\u6CE2,\u6606\u660E
sur_name=\u8D75, \u94B1, \u5B59, \u674E, \u5468, \u5434, \u90D1, \u738B, \u51AF, \u9648, \u891A, \u536B, \u848B, \u6C88, \u97E9, \u6768,\u6731, \u79E6, \u5C24, \u8BB8, \u4F55, \u5415, \u65BD, \u5F20, \u5B54, \u66F9, \u4E25, \u534E, \u91D1, \u9B4F, \u9676, \u59DC, \u621A, \u8C22, \u90B9, \u55BB, \u67CF,\
          \u6C34, \u7AA6, \u7AE0, \u4E91, \u82CF, \u6F58, \u845B, \u595A, \u8303, \u5F6D, \u90CE, \u9C81, \u97E6, \u660C, \u9A6C, \u82D7, \u51E4, \u82B1, \u65B9, \u4FDE, \u4EFB,\
          \u8881, \u67F3, \u9146, \u9C8D, \u53F2, \u5510, \u8D39, \u5EC9, \u5C91, \u859B, \u96F7, \u8D3A, \u502A, \u6C64, \u6ED5, \u6BB7, \u7F57, \u6BD5, \u90DD, \u90AC, \u5B89,\
          \u5E38, \u4E50, \u4E8E, \u65F6, \u5085, \u76AE, \u535E, \u9F50, \u5EB7, \u4F0D, \u4F59, \u5143, \u535C, \u987E, \u5B5F, \u5E73, \u9EC4, \u548C, \u7A46, \u8427, \u5C39,\
          \u59DA, \u90B5, \u6E5B, \u6C6A, \u7941, \u6BDB, \u79B9, \u72C4, \u7C73, \u8D1D, \u660E, \u81E7, \u8BA1, \u4F0F, \u6210, \u6234, \u8C08, \u5B8B, \u8305, \u5E9E, \u718A,\
          \u7EAA, \u8212, \u5C48, \u9879, \u795D, \u8463, \u6881, \u675C, \u962E, \u84DD, \u95F5, \u5E2D, \u5B63, \u9EBB, \u5F3A, \u8D3E, \u8DEF, \u5A04, \u5371, \u6C5F, \u7AE5,\
          \u989C, \u90ED, \u6885, \u76DB, \u6797, \u5201, \u949F, \u5F90, \u90B1, \u9A86, \u9AD8, \u590F, \u8521, \u7530, \u6A0A, \u80E1, \u51CC, \u970D, \u865E, \u4E07, \u652F,\
          \u67EF, \u661D, \u7BA1, \u5362, \u83AB, \u7ECF, \u623F, \u88D8, \u7F2A, \u5E72, \u89E3, \u5E94, \u5B97, \u4E01, \u5BA3, \u8D32, \u9093, \u90C1, \u5355, \u676D, \u6D2A,\
          \u5305, \u8BF8, \u5DE6, \u77F3, \u5D14, \u5409, \u94AE, \u9F9A, \u7A0B, \u5D47, \u90A2, \u6ED1, \u88F4, \u9646, \u8363, \u7FC1, \u8340, \u7F8A, \u4E8E, \u60E0, \u7504,\
          \u66F2, \u5BB6, \u5C01, \u82AE, \u7FBF, \u50A8, \u9773, \u6C72, \u90B4, \u7CDC, \u677E, \u4E95, \u6BB5, \u5BCC, \u5DEB, \u4E4C, \u7126, \u5DF4, \u5F13, \u7267, \u9697,\
          \u5C71, \u8C37, \u8F66, \u4FAF, \u5B93, \u84EC, \u5168, \u90D7, \u73ED, \u4EF0, \u79CB, \u4EF2, \u4F0A, \u5BAB, \u5B81, \u4EC7, \u683E, \u66B4, \u7518, \u94AD, \u5389,\
          \u620E, \u7956, \u6B66, \u7B26, \u5218, \u666F, \u8A79, \u675F, \u9F99, \u53F6, \u5E78, \u53F8, \u97F6, \u90DC, \u9ECE, \u84DF, \u6EA5, \u5370, \u5BBF, \u767D, \u6000,\
          \u84B2, \u90B0, \u4ECE, \u9102, \u7D22, \u54B8, \u7C4D, \u8D56, \u5353, \u853A, \u5C60, \u8499, \u6C60, \u4E54, \u9634, \u90C1, \u80E5, \u80FD, \u82CD, \u53CC, \u95FB,\
          \u8398, \u515A, \u7FDF, \u8C2D, \u8D21, \u52B3, \u9004, \u59EC, \u7533, \u6276, \u5835, \u5189, \u5BB0, \u90E6, \u96CD, \u5374, \u74A9, \u6851, \u6842, \u6FEE, \u725B,\
          \u5BFF, \u901A, \u8FB9, \u6248, \u71D5, \u5180, \u6D66, \u5C1A, \u519C, \u6E29, \u522B, \u5E84, \u664F, \u67F4, \u77BF, \u960E, \u5145, \u6155, \u8FDE, \u8339, \u4E60,\
          \u5BA6, \u827E, \u9C7C, \u5BB9, \u5411, \u53E4, \u6613, \u614E, \u6208, \u5ED6, \u5EBE, \u7EC8, \u66A8, \u5C45, \u8861, \u6B65, \u90FD, \u803F, \u6EE1, \u5F18, \u5321,\
          \u56FD, \u6587, \u5BC7, \u5E7F, \u7984, \u9619, \u4E1C, \u6B27, \u6BB3, \u6C83, \u5229, \u851A, \u8D8A, \u5914, \u9686, \u5E08, \u5DE9, \u538D, \u8042, \u6641, \u52FE,\
          \u6556, \u878D, \u51B7, \u8A3E, \u8F9B, \u961A, \u90A3, \u7B80, \u9976, \u7A7A, \u66FE, \u6BCB, \u6C99, \u4E5C, \u517B, \u97A0, \u987B, \u4E30, \u5DE2, \u5173, \u84AF,\
          \u76F8, \u67E5, \u540E, \u8346, \u7EA2, \u6E38, \u90CF, \u7AFA, \u6743, \u902F, \u76D6, \u76CA, \u6853, \u516C, \u4EC9, \u7763, \u5CB3, \u5E05, \u7F11, \u4EA2, \u51B5,\
          \u90C8, \u6709, \u7434, \u5F52, \u6D77, \u664B, \u695A, \u95EB, \u6CD5, \u6C5D, \u9122, \u6D82, \u94A6, \u5546, \u725F, \u4F58, \u4F74, \u4F2F, \u8D4F, \u58A8, \u54C8,\
          \u8C2F, \u7BC1, \u5E74, \u7231, \u9633, \u4F5F, \u8A00, \u798F, \u5357, \u706B, \u94C1, \u8FDF, \u6F06, \u5B98, \u51BC, \u771F, \u5C55, \u7E41, \u6A80, \u796D, \u5BC6,\
          \u656C, \u63ED, \u821C, \u697C, \u758F, \u5192, \u6D51, \u631A, \u80F6, \u968F, \u9AD8, \u768B, \u539F, \u79CD, \u7EC3, \u5F25, \u4ED3, \u772D, \u8E47, \u8983, \u963F,\
          \u95E8, \u607D, \u6765, \u7DA6, \u53EC, \u4EEA, \u98CE, \u4ECB, \u5DE8, \u6728, \u4EAC, \u72D0, \u90C7, \u864E, \u679A, \u6297, \u8FBE, \u675E, \u82CC, \u6298, \u9EA6,\
          \u5E86, \u8FC7, \u7AF9, \u7AEF, \u9C9C, \u7687, \u4E93, \u8001, \u662F, \u79D8, \u7545, \u909D, \u8FD8, \u5BBE, \u95FE, \u8F9C, \u7EB5, \u4FB4, \u4E07\u4FDF, \u53F8\u9A6C, \u4E0A\u5B98,\
          \u6B27\u9633, \u590F\u4FAF, \u8BF8\u845B, \u95FB\u4EBA, \u4E1C\u65B9, \u8D6B\u8FDE, \u7687\u752B, \u7F8A\u820C, \u5C09\u8FDF, \u516C\u7F8A, \u6FB9\u53F0, \u516C\u51B6, \u5B97\u6B63, \u6FEE\u9633, \u6DF3\u4E8E, \u5355\u4E8E, \u592A\u53D4, \u7533\u5C60,\
          \u516C\u5B59, \u4EF2\u5B59, \u8F69\u8F95, \u4EE4\u72D0, \u949F\u79BB, \u5B87\u6587, \u957F\u5B59, \u6155\u5BB9, \u9C9C\u4E8E, \u95FE\u4E18, \u53F8\u5F92, \u53F8\u7A7A, \u5140\u5B98, \u53F8\u5BC7, \u5357\u95E8, \u547C\u5EF6, \u5B50\u8F66, \u989B\u5B59,\
          \u7AEF\u6728, \u5DEB\u9A6C, \u516C\u897F, \u6F06\u96D5, \u8F66\u6B63, \u58E4\u9A77, \u516C\u826F, \u62D3\u8DCB, \u5939\u8C37, \u5BB0\u7236, \u8C37\u6881, \u6BB5\u5E72, \u767E\u91CC, \u4E1C\u90ED, \u5FAE\u751F, \u6881\u4E18, \u5DE6\u4E18, \u4E1C\u95E8,\
          \u897F\u95E8, \u5357\u5BAB, \u7B2C\u4E94, \u516C\u4EEA, \u516C\u4E58, \u592A\u53F2, \u4EF2\u957F, \u53D4\u5B59, \u5C48\u7A81, \u5C14\u6731, \u4E1C\u4E61, \u76F8\u91CC, \u80E1\u6BCD, \u53F8\u57CE, \u5F20\u5ED6, \u96CD\u95E8, \u6BCB\u4E18, \u8D3A\u5170,\
          \u7DA6\u6BCB, \u5C4B\u5E90, \u72EC\u5B64, \u5357\u90ED, \u5317\u5BAB, \u738B\u5B59